app/Controllers/Admin.php

    public function dashboard()
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') != 'admin') {
            return redirect()->to('admin_login');
        }

        // Get all results
        $data['results'] = $this->quiz_takers->orderBy('created_at', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `quiz_takers`
ORDER BY `created_at` DESC

    public function result_details($id)
    {
        if (!$this->session->get('isLoggedIn') || $this->session->get('role') != 'admin') {
            return redirect()->to('admin_login');
        }

        $result = $this->quiz_takers->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `quiz_takers`
WHERE `id` = '42'