app/Controllers/Auth.php

    public function login()
    {
        $request = \Config\Services::request();

        $full_name = trim($request->getPost('full_name'));
        $email = trim($request->getPost('email'));
        $screen_size = $request->getPost('screen_size');
        $device_type = ($screen_size > 700) ? 'desktop' : 'mobile';

        // Check for Admin redirection
        if (strtolower($full_name) === 'admin' || strtolower($email) === 'admin') {
            return redirect()->to('admin_login');
        }

        // Check if user already took the quiz
        $existing_user = $this->quiz_takers
                              ->where('email', $email)
                              ->where('score !=', null)
                              ->get()
                              ->getRowArray();
---
SELECT *
FROM `quiz_takers`
WHERE `email` = 'shashivardhan630@gmail.comffffff'
AND `score` IS NOT NULL