app/Controllers/Quiz.php

SELECT COUNT(*) AS `numrows`
FROM `quiz_takers`
WHERE `email` = 'shashivardhan630@gmail.comffffff'
---
    public function submit()
    {
        $request = \Config\Services::request();
        $json = $request->getJSON();

        $score = $json->score;
        $responses = isset($json->responses) ? json_encode($json->responses) : (isset($json->details) ? json_encode($json->details) : null);

        $email = $this->session->get('user_id');
        $full_name = $this->session->get('full_name');
        $device = $this->session->get('device_type');
        $screen = $this->session->get('screen_size');

        if (!$email || !$full_name) {
            return $this->response->setStatusCode(401)->setJSON(['status' => 'error', 'message' => 'Session expired or invalid.']);
        }

        $data = [
            'full_name'   => $full_name,
            'email'       => $email,
            'score'       => $score,
            'status'      => ($score >= 70) ? 'Pass' : 'Fail',
            'device_type' => $device,
            'screen_size' => $screen,
            'responses'   => $responses
        ];

        // Check if partial record exists, update or insert
        $exists = $this->quiz_takers->where('email', $email)->countAllResults();